; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v2)
             (pred_10 ?v7 ?v4)
             (pred_5 ?v12 ?v4)
             (pred_7 ?v6 ?v12 )
	     (pred_11 ?v12)
             (pred_8 ?v1)
             (pred_6 ?v7)
             (pred_4 ?v4)
             (pred_3 ?v12)
             (pred_12 ?v7)
             (pred_1 ?v12)
             (pred_2 ))



(:action op_4
:parameters (?v8 ?v13 ?v3 ?v9)
:precondition (and (pred_8 ?v8) (pred_8 ?v13) (pred_6 ?v3) (pred_4 ?v9)
          (pred_9 ?v8 ?v13) (pred_10 ?v3 ?v9)
                   (pred_5 ?v13 ?v9) (pred_11 ?v8) 
                   (pred_3 ?v13) (pred_12 ?v3))
:effect (and  (pred_1 ?v13) (not (pred_3 ?v13))))


(:action op_5
:parameters (?v8 ?v11)
:precondition (and (pred_8 ?v8) (pred_8 ?v11)
               (pred_11 ?v8) (pred_9 ?v8 ?v11) (pred_1 ?v11))
:effect (and (pred_11 ?v11) (not (pred_11 ?v8))))

(:action op_2
:parameters (?v8 ?v3)
:precondition (and (pred_8 ?v8) (pred_6 ?v3) 
                  (pred_11 ?v8) (pred_7 ?v3 ?v8) (pred_2 ))
:effect (and (pred_12 ?v3)
   (not (pred_7 ?v3 ?v8)) (not (pred_2 ))))


(:action op_1
:parameters (?v8 ?v10 ?v5)
:precondition (and (pred_8 ?v8) (pred_6 ?v10) (pred_6 ?v5)
                  (pred_11 ?v8) (pred_12 ?v5) (pred_7 ?v10 ?v8))
:effect (and (pred_12 ?v10) (pred_7 ?v5 ?v8)
        (not (pred_12 ?v5)) (not (pred_7 ?v10 ?v8))))

(:action op_3
:parameters (?v8 ?v3)
:precondition (and (pred_8 ?v8) (pred_6 ?v3) 
                  (pred_11 ?v8) (pred_12 ?v3))
:effect (and (pred_2 ) (pred_7 ?v3 ?v8) (not (pred_12 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_26 obj_05 obj_01 obj_22 obj_17 obj_25 obj_30 obj_23 obj_08 obj_06 obj_03 obj_04 obj_11 obj_28 obj_24 obj_07 obj_27 obj_12 obj_15 obj_21 obj_29 obj_20 obj_19 obj_09
    obj_31 obj_02 obj_10
    obj_18 obj_14 obj_13
    )

    (:init
       (pred_2)

       (pred_8 obj_16)
       (pred_8 obj_26)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_22)
       (pred_8 obj_17)
       (pred_8 obj_25)
       (pred_8 obj_30)
       (pred_8 obj_23)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_8 obj_03)
       (pred_8 obj_04)
       (pred_8 obj_11)
       (pred_8 obj_28)
       (pred_8 obj_24)
       (pred_8 obj_07)
       (pred_8 obj_27)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_21)
       (pred_8 obj_29)
       (pred_8 obj_20)
       (pred_8 obj_19)
       (pred_8 obj_09)
       (pred_4 obj_31)
       (pred_4 obj_02)
       (pred_4 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_13)

       (pred_9 obj_16 obj_17)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_26 obj_25)
       (pred_9 obj_26 obj_05)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_05 obj_30)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_05 obj_26)
       (pred_9 obj_01 obj_23)
       (pred_9 obj_01 obj_22)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_22 obj_08)
       (pred_9 obj_22 obj_01)
       (pred_9 obj_17 obj_06)
       (pred_9 obj_17 obj_25)
       (pred_9 obj_17 obj_16)
       (pred_9 obj_25 obj_03)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_25 obj_26)
       (pred_9 obj_25 obj_17)
       (pred_9 obj_30 obj_04)
       (pred_9 obj_30 obj_23)
       (pred_9 obj_30 obj_05)
       (pred_9 obj_30 obj_25)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_23 obj_08)
       (pred_9 obj_23 obj_01)
       (pred_9 obj_23 obj_30)
       (pred_9 obj_08 obj_28)
       (pred_9 obj_08 obj_22)
       (pred_9 obj_08 obj_23)
       (pred_9 obj_06 obj_24)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_17)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_03 obj_25)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_04 obj_27)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_04 obj_30)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_28)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_11 obj_04)
       (pred_9 obj_28 obj_15)
       (pred_9 obj_28 obj_08)
       (pred_9 obj_28 obj_11)
       (pred_9 obj_24 obj_21)
       (pred_9 obj_24 obj_07)
       (pred_9 obj_24 obj_06)
       (pred_9 obj_07 obj_29)
       (pred_9 obj_07 obj_27)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_07 obj_24)
       (pred_9 obj_27 obj_20)
       (pred_9 obj_27 obj_12)
       (pred_9 obj_27 obj_04)
       (pred_9 obj_27 obj_07)
       (pred_9 obj_12 obj_19)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_27)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_15 obj_28)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_21 obj_29)
       (pred_9 obj_21 obj_24)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_07)
       (pred_9 obj_29 obj_21)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_20 obj_27)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_12)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_19)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_07)
       (pred_5  obj_06 obj_31)
       (pred_5  obj_03 obj_02)
       (pred_5  obj_07 obj_10)
       (pred_1 obj_16)
       (pred_1 obj_26)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_22)
       (pred_1 obj_17)
       (pred_1 obj_25)
       (pred_1 obj_30)
       (pred_1 obj_23)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_28)
       (pred_1 obj_24)
       (pred_1 obj_27)
       (pred_1 obj_12)
       (pred_1 obj_15)
       (pred_1 obj_21)
       (pred_1 obj_29)
       (pred_1 obj_20)
       (pred_1 obj_19)
       (pred_1 obj_09)

       (pred_10  obj_18 obj_31)
       (pred_10  obj_14 obj_02)
       (pred_10  obj_13 obj_10)
       (pred_7 obj_18 obj_05)
       (pred_7 obj_14 obj_20)
       (pred_7 obj_13 obj_04)
       (pred_11 obj_24)
    )

    (:goal (and
       (pred_7 obj_14 obj_22)
       (pred_7 obj_13 obj_25)
    ))
(:constraints
  (always (not (pred_11 obj_30)))
)
)

; plan
1. (op_5 obj_24 obj_21)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_21)
   goals met: 0 of 2
2. (op_5 obj_21 obj_29)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_29)
   goals met: 0 of 2
3. (op_5 obj_29 obj_20)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_20)
   goals met: 0 of 2
4. (op_2 obj_20 obj_14)
   deleted: (pred_7 obj_14 obj_20) (pred_2)
   added: (pred_12 obj_14)
   goals met: 0 of 2
5. (op_5 obj_20 obj_27)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_27)
   goals met: 0 of 2
6. (op_5 obj_27 obj_04)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_04)
   goals met: 0 of 2
7. (op_4 obj_04 obj_03 obj_14 obj_02)
   deleted: (pred_3 obj_03)
   added: (pred_1 obj_03)
   goals met: 0 of 2
8. (op_1 obj_04 obj_13 obj_14)
   deleted: (pred_12 obj_14) (pred_7 obj_13 obj_04)
   added: (pred_12 obj_13) (pred_7 obj_14 obj_04)
   goals met: 0 of 2
9. (op_5 obj_04 obj_03)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_03)
   goals met: 0 of 2
10. (op_5 obj_03 obj_25)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_25)
   goals met: 0 of 2
11. (op_3 obj_25 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_2) (pred_7 obj_13 obj_25)
   goals met: 1 of 2
12. (op_5 obj_25 obj_03)
   deleted: (pred_11 obj_25)
   added: (pred_11 obj_03)
   goals met: 1 of 2
13. (op_5 obj_03 obj_04)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_04)
   goals met: 1 of 2
14. (op_2 obj_04 obj_14)
   deleted: (pred_7 obj_14 obj_04) (pred_2)
   added: (pred_12 obj_14)
   goals met: 1 of 2
15. (op_5 obj_04 obj_11)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_11)
   goals met: 1 of 2
16. (op_5 obj_11 obj_23)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_23)
   goals met: 1 of 2
17. (op_5 obj_23 obj_01)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_01)
   goals met: 1 of 2
18. (op_5 obj_01 obj_22)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_22)
   goals met: 1 of 2
19. (op_3 obj_22 obj_14)
   deleted: (pred_12 obj_14)
   added: (pred_2) (pred_7 obj_14 obj_22)
   goals met: 2 of 2
